burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_hpdf.c
/*!
    \brief      disable malfunction monitor (API_ID(0x0015U))
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_malfunction_monitor_disable(hpdf_channel_enum channelx)
{
    HPDF_CHxCTL(channelx) &= ~HPDF_CHxCTL_MMEN;
}
/*!
    \brief      enable malfunction monitor (API_ID(0x0016U))
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_malfunction_monitor_enable(hpdf_channel_enum channelx)
{
    HPDF_CHxCTL(channelx) |= HPDF_CHxCTL_MMEN;
}

/*!
    \brief      disable clock loss detector (API_ID(0x0017U))
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_clock_loss_disable(hpdf_channel_enum channelx)
{
    HPDF_CHxCTL(channelx) &= ~HPDF_CHxCTL_CKLEN;
}

/*!
    \brief      enable clock loss detector (API_ID(0x0018U))
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_clock_loss_enable(hpdf_channel_enum channelx)
{
    HPDF_CHxCTL(channelx) |= HPDF_CHxCTL_CKLEN;
}

/*!
    \brief      disable channel inputs pins redirection (API_ID(0x0019U))
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_channel_pin_redirection_disable(hpdf_channel_enum channelx)
{
    /* make sure the CHEN=0 */
    if(RESET == (HPDF_CHxCTL(channelx) & HPDF_CHxCTL_CHEN)) {
        HPDF_CHxCTL(channelx) &= ~HPDF_CHxCTL_CHPINSEL;
    }
}

/*!
    \brief      enable channel inputs pins redirection (API_ID(0x001AU))
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_channel_pin_redirection_enable(hpdf_channel_enum channelx)
{
    /* make sure the CHEN=0 */
    if(RESET == (HPDF_CHxCTL(channelx) & HPDF_CHxCTL_CHEN)) {
        HPDF_CHxCTL(channelx) |= HPDF_CHxCTL_CHPINSEL;
    }
}

/*!
    \brief      configure channel multiplexer select input data source (API_ID(0x001BU))
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[in]  data_source: input data source
                only one parameter can be selected which is shown as below:
    \arg          SERIAL_INPUT: input data source is taken from serial inputs
    \arg          INTERNAL_INPUT: input data source is taken from internal HPDF_CHxPDI register
    \param[out] none
    \retval     none
*/
void hpdf_channel_multiplexer_config(hpdf_channel_enum channelx, uint32_t data_source)
{
    uint32_t reg;
    reg = HPDF_CHxCTL(channelx);
    /* make sure the CHEN=0 */
    if(RESET == (reg & HPDF_CHxCTL_CHEN)) {
        reg &= ~HPDF_CHxCTL_CMSD;
        /* configure the input data source */
        reg |= data_source;
        HPDF_CHxCTL(channelx) = reg;
    }
}

/*!
    \brief      configure data packing mode (API_ID(0x001CU))
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[in]  mode: parallel data packing mode
                only one parameter can be selected which is shown as below:
    \arg          DPM_STANDARD_MODE : standard mode
    \arg          DPM_INTERLEAVED_MODE: interleaved mode
    \arg          DPM_DUAL_MODE: dual mode
    \param[out] none
    \retval     none
*/
void hpdf_data_pack_mode_config(hpdf_channel_enum channelx, uint32_t mode)
{
    uint32_t reg;
    reg = HPDF_CHxCTL(channelx);
    /* make sure the CHEN=0 */
    if(RESET == (reg & HPDF_CHxCTL_CHEN)) {
        reg &= ~HPDF_CHxCTL_DPM;
        /* configure the data packing mode */
        reg |= mode;
        HPDF_CHxCTL(channelx) = reg;
    }
}
/*!
    \brief      configure data right bit-shift (API_ID(0x001DU))
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[in]  right_shift: the number of bits that determine the right shift(0-31)
    \param[out] none
    \retval     none
*/
void hpdf_data_right_bit_shift_config(hpdf_channel_enum channelx, uint8_t right_shift)
{
    uint32_t reg;

    /* make sure the CHEN=0 */
    if(RESET == (HPDF_CHxCTL(channelx) & HPDF_CHxCTL_CHEN)) {
        reg = HPDF_CHxCFG0(channelx);
        reg &= ~HPDF_CHxCFG0_DTRS;
        /* configure the right shift */
        reg |= ((uint32_t)right_shift << CHyCFG_DTRS_OFFSET);
        HPDF_CHxCFG0(channelx) = reg;
    }
}

/*!
    \brief      configure calibration offset (API_ID(0x001EU))
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[in]  offset: 24-bit calibration offset, must be in (-8388608~8388607)
    \param[out] none
    \retval     none
*/
void hpdf_calibration_offset_config(hpdf_channel_enum channelx, int32_t offset)
{
    uint32_t reg;

    reg = HPDF_CHxCFG0(channelx);
    reg &= ~HPDF_CHxCFG0_CALOFF;
    /* configure the calibration offset */
    reg |= ((uint32_t)offset << CHyCFG0_CALOFF_OFFSET);
    HPDF_CHxCFG0(channelx) = reg;   
}

/*!
    \brief      configure malfunction monitor break signal (API_ID(0x001FU))
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[in]  break_signal: malfunction monitor break signal distribution
                  only one parameter can be selected which is shown as below:
    \arg          NO_MM_BREAK: break signal is not distributed to malfunction monitor on channel
    \arg          MM_BREAK0: break signal 0 is distributed to malfunction monitor on channel
    \arg          MM_BREAK1: break signal 1 is distributed to malfunction monitor on channel
    \arg          MM_BREAK0_1: break signal 0 and 1 is distributed to malfunction monitor on channel
    \param[out] none
    \retval     none
*/
void hpdf_malfunction_break_signal_config(hpdf_channel_enum channelx, uint32_t break_signal)
{
    uint32_t reg;
    reg = HPDF_CHxCFG1(channelx);
    reg &= ~HPDF_CHxCFG1_MMBSD;
    /* configure the break signal */
    reg |= (break_signal & HPDF_CHxCFG1_MMBSD);
    HPDF_CHxCFG1(channelx) = reg;
}

/*!
    \brief      configure malfunction monitor counter threshold (API_ID(0x0020U))
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[in]  threshold: malfunction monitor counter threshold(0-255)
    \param[out] none
    \retval     none
*/
void hpdf_malfunction_counter_config(hpdf_channel_enum channelx, uint8_t threshold)
{
    uint32_t reg;

    reg = HPDF_CHxCFG1(channelx);
    reg &= ~HPDF_CHxCFG1_MMCT;
    /* configure the malfunction monitor counter threshold */
    reg |= (threshold & HPDF_CHxCFG1_MMCT);
    HPDF_CHxCFG1(channelx) = reg;
}

/*!
    \brief      write the parallel data on standard mode of data packing (API_ID(0x0021U))
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[in]  data: the parallel data
    \param[out] none
    \retval     none
*/
void hpdf_write_parallel_data_standard_mode(hpdf_channel_enum channelx, int16_t data)
{
    uint32_t reg;
    /* make sure HPDF channel is used receive parallel data */
    if(INTERNAL_INPUT == (HPDF_CHxCTL(channelx) & INTERNAL_INPUT)) {
        /* make sure the data pack of HPDF_CHxPDI register is standard mode */
        if(DPM_STANDARD_MODE == (HPDF_CHxCTL(channelx) & DPM_STANDARD_MODE)) {
            reg = HPDF_CHxPDI(channelx);
            reg &= ~HPDF_CHxPDI_IDATA0;
            reg |= (uint16_t)data;
            HPDF_CHxPDI(channelx) = reg;
        }
    }
}

/*!
    \brief      write the parallel data on interleaved mode of data packing (API_ID(0x0022U))
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[in]  data: the parallel data
    \param[out] none
    \retval     none
*/
void hpdf_write_parallel_data_interleaved_mode(hpdf_channel_enum channelx, int32_t data)
{
    uint32_t reg;
    /* make sure HPDF channel is used receive parallel data */
    if(INTERNAL_INPUT == (HPDF_CHxCTL(channelx) & INTERNAL_INPUT)) {
        /* make sure the data pack of HPDF_CH0PDI register is interleaved mode */
        if(DPM_INTERLEAVED_MODE == (HPDF_CHxCTL(channelx) & DPM_INTERLEAVED_MODE)) {
            reg = HPDF_CHxPDI(channelx);
            reg &= ~(HPDF_CHxPDI_IDATA0 | HPDF_CHxPDI_IDATA1);
            reg |= (uint32_t)data;
            HPDF_CHxPDI(channelx) = reg;
        }
    }
}

/*!
    \brief      write the parallel data on dual mode of data packing (API_ID(0x0023U))
    \param[in]  channelx: CHANNELx(x=0)
    \param[in]  data: the parallel data
    \param[out] none
    \retval     none
*/
void hpdf_write_parallel_data_dual_mode(hpdf_channel_enum channelx, int32_t data)
{
    uint32_t reg;
    /* make sure HPDF channel is used receive parallel data */
    if(INTERNAL_INPUT == (HPDF_CHxCTL(CHANNEL0) & INTERNAL_INPUT)) {
        /* make sure the data pack of HPDF_CH0PDI register is dual mode */
        if(DPM_DUAL_MODE == (HPDF_CHxCTL(CHANNEL0) & DPM_DUAL_MODE)) {
            reg = HPDF_CHxPDI(CHANNEL0);
            reg &= ~(HPDF_CHxPDI_IDATA0 | HPDF_CHxPDI_IDATA1);
            reg |= (uint32_t)data;
            HPDF_CHxPDI(CHANNEL0) = reg;
        }
    }
}

/*!
    \brief      update the number of pulses to skip (API_ID(0x0024U))
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[in]  number: the number of serial input samples that will be skipped, 0~63
    \param[out] none
    \retval     none
*/
void hpdf_pulse_skip_update(hpdf_channel_enum channelx, uint8_t number)
{
    uint32_t reg;
    reg = HPDF_CHxPS(channelx);
    reg &= ~HPDF_CHxPS_PLSK;
    /* update the number of pulses to skip */
    reg |= ((uint32_t)number & HPDF_CHxPS_PLSK);
    HPDF_CHxPS(channelx) = reg;
}

/*!
    \brief      read the number of pulses to skip (API_ID(0x0025U))
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[out] none
    \retval     the number of pulses to skip
*/
uint8_t hpdf_pulse_skip_read(hpdf_channel_enum channelx)
{
    uint8_t val;
    /* read the number of pulses to skip */
    val = (uint8_t)HPDF_CHxPS(channelx);
    return val;
}

/*!
    \brief      enable filter (API_ID(0x0026U))
    \param[in]  filtery: FLTy(y=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_filter_enable(hpdf_filter_enum filtery)
{
    HPDF_FLTyCTL0(filtery) |= HPDF_FLTyCTL0_FLTEN;
}

/*!
    \brief      disable filter (API_ID(0x0027U))
    \param[in]  filtery: FLTy(y=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_filter_disable(hpdf_filter_enum filtery)
{
    HPDF_FLTyCTL0(filtery) &= ~HPDF_FLTyCTL0_FLTEN;
}

/*!
    \brief      configure sinc filter order and oversample (API_ID(0x0028U))
    \param[in]  filtery: FLTy(y=0,1)
    \param[in]  order: sinc filter order
                only one parameter can be selected which is shown as below:
    \arg          FLT_FASTSINC: FastSinc filter type
    \arg          FLT_SINC1: Sinc1 filter type
    \arg          FLT_SINC2: Sinc2 filter type
    \arg          FLT_SINC3: Sinc3 filter type
    \arg          FLT_SINC4: Sinc4 filter type
    \arg          FLT_SINC5: Sinc5 filter type
    \param[in]  oversample: Sinc filter oversampling rate(1-1024)
    \param[out] none
    \retval     none
*/
void hpdf_filter_config(hpdf_filter_enum filtery, uint32_t order, uint16_t oversample)
{
    uint32_t reg;
    
    if(oversample > 0U) {
        oversample = oversample - 1U;
    }
    /* make sure the FLTEN=0 */
    if(RESET == (HPDF_FLTyCTL0(filtery) & HPDF_FLTyCTL0_FLTEN)) {
        reg = HPDF_FLTySFCFG(filtery);
        reg &= ~(HPDF_FLTySFCFG_SFO | HPDF_FLTySFCFG_SFOR);
        /* configure the sinc filter order and oversample */
        reg |= (order | ((uint32_t)oversample << FLTySFCFG_SFOR_OFFSET));
        HPDF_FLTySFCFG(filtery) = reg;
    }
    
