burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_hpdf.c
}

/*!
    \brief      configure integrator oversampling rate (API_ID(0x0029U))
    \param[in]  filtery: FLTy(y=0,1)
    \param[in]  oversample: integrator oversampling rate(1-256)
    \param[out] none
    \retval     none
*/
void hpdf_integrator_oversample(hpdf_filter_enum filtery, uint16_t oversample)
{
    uint32_t reg;

    if(oversample > 0U) {
        oversample = oversample - 1U;
    }
    /* make sure the FLTEN=0 */
    if(RESET == (HPDF_FLTyCTL0(filtery) & HPDF_FLTyCTL0_FLTEN)) {
        reg = HPDF_FLTySFCFG(filtery);
        reg &= ~HPDF_FLTySFCFG_IOR;
        /* configure the integrator oversampling rate */
        reg |= (uint32_t)oversample;
        HPDF_FLTySFCFG(filtery) = reg;
    }
}

/*!
    \brief      configure threshold monitor filter order and oversample (API_ID(0x002AU))
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[in]  order: threshold monitor Sinc filter order
                only one parameter can be selected which is shown as below:
    \arg          TM_FASTSINC: FastSinc filter type
    \arg          TM_SINC1: Sinc1 filter type
    \arg          TM_SINC2: Sinc2 filter type
    \arg          TM_SINC3: Sinc3 filter type
    \param[in]  oversample: Sinc filter oversampling rate(1-32)
    \param[out] none
    \retval     none
*/
void hpdf_threshold_monitor_filter_config(hpdf_channel_enum channelx, uint32_t order, uint8_t oversample)
{
    uint32_t reg;

    if(oversample > 0U) {
        oversample = oversample - 1U;
    }
    /* make sure the CHEN=0 */
    if(RESET == (HPDF_CHxCTL(channelx) & HPDF_CHxCTL_CHEN)) {
        reg = HPDF_CHxCFG1(channelx);
        reg &= ~(HPDF_CHxCFG1_TMSFO | HPDF_CHxCFG1_TMFOR);
        /* configure the threshold monitor filter order and oversample rate */
        reg |= (order | ((uint32_t)oversample << CHyCFG1_TMFOR_OFFSET));
        HPDF_CHxCFG1(channelx) = reg;
    }
}

/*!
    \brief      read the threshold monitor filter data (API_ID(0x002BU))
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[out] none
    \retval     the threshold monitor filter data
*/
int16_t hpdf_threshold_monitor_filter_read_data(hpdf_channel_enum channelx)
{
    int16_t val;
    val = (int16_t)HPDF_CHxTMFDT(channelx);
    return val;
}

/*!
    \brief      disable threshold monitor fast mode (API_ID(0x002CU))
    \param[in]  filtery: HPDF_FLTy(y=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_threshold_monitor_fast_mode_disable(hpdf_filter_enum filtery)
{
    HPDF_FLTyCTL0(filtery) &= ~HPDF_FLTyCTL0_TMFM;
}

/*!
    \brief      enable threshold monitor fast mode (API_ID(0x002DU))
    \param[in]  filtery: FLTy(y=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_threshold_monitor_fast_mode_enable(hpdf_filter_enum filtery)
{
    HPDF_FLTyCTL0(filtery) |= HPDF_FLTyCTL0_TMFM;
}

/*!
    \brief      configure threshold monitor channel (API_ID(0x002EU))
    \param[in]  filtery: FLTy(y=0,1)
    \param[in]  channel: which channel use threshold monitorx(x=0,1)
                only one parameter can be selected which is shown as below:
    \arg          TMCHEN_DISABLE: threshold monitor is disabled on channel 0 and channel 1
    \arg          TMCHEN_CHANNEL0: threshold monitor is enabled on channel 0
    \arg          TMCHEN_CHANNEL1: threshold monitor is enabled on channel 1
    \arg          TMCHEN_CHANNEL0_1: threshold monitor is enabled on channel 0 and channel 1
    \param[out] none
    \retval     none
*/
void hpdf_threshold_monitor_channel(hpdf_filter_enum filtery, uint32_t channel)
{
    uint32_t reg;
    reg = HPDF_FLTyCTL1(filtery);
    reg &= ~HPDF_FLTyCTL1_TMCHEN;
    /* configure the channel which threshold monitor watch on */
    reg |= channel;
    HPDF_FLTyCTL1(filtery) = reg;
}

/*!
    \brief      configure threshold monitor high threshold value (API_ID(0x002FU))
    \param[in]  filtery: FLTy(y=0,1)
    \param[in]  value: high threshold value(-8388608~8388607)
    \param[out] none
    \retval     none
*/
void hpdf_threshold_monitor_high_threshold(hpdf_filter_enum filtery, int32_t value)
{
    uint32_t reg;
    reg = HPDF_FLTyTMHT(filtery);
    reg &= ~HPDF_FLTyTMHT_HTVAL;
    /* write the signed value */
    reg |= (uint32_t)value << FLTyTMHT_HTVAL_OFFSET;
    HPDF_FLTyTMHT(filtery) = reg;
}

/*!
    \brief      configure threshold monitor low threshold value (API_ID(0x0030U))
    \param[in]  filtery: FLTy(y=0,1)
    \param[in]  value: low threshold value(-8388608~8388607)
    \param[out] none
    \retval     none
*/
void hpdf_threshold_monitor_low_threshold(hpdf_filter_enum filtery, int32_t value)
{
    uint32_t reg;
    reg = HPDF_FLTyTMLT(filtery);
    reg &= ~HPDF_FLTyTMLT_LTVAL;
    /* write the signed value */
    reg |= (uint32_t)value << FLTyTMLT_LTVAL_OFFSET ;
    HPDF_FLTyTMLT(filtery) = reg;
}

/*!
    \brief      configure threshold monitor high threshold event break signal (API_ID(0x0031U))
    \param[in]  filtery: FLTy(y=0,1)
    \param[in]   break_signal: HPDF break signal
                 only one parameter can be selected which is shown as below:
    \arg          NO_TM_HT_BREAK: break signal is not distributed to an threshold monitor high threshold event
    \arg          TM_HT_BREAK0: break signal 0 is distributed to an threshold monitor high threshold event
    \arg          TM_HT_BREAK1: break signal 1 is distributed to an threshold monitor high threshold event
    \arg          TM_HT_BREAK0_1: break signal 0 and 1 is distributed to an threshold monitor high threshold event
    \param[out] none
    \retval     none
*/
void hpdf_high_threshold_break_signal(hpdf_filter_enum filtery, uint32_t break_signal)
{
    uint32_t reg;
    reg = HPDF_FLTyTMHT(filtery);
    reg &= ~HPDF_FLTyTMHT_HTBSD;
    /* configure the break signal */
    reg |= break_signal;
    HPDF_FLTyTMHT(filtery) = reg;
}

/*!
    \brief      configure threshold monitor low threshold event break signal (API_ID(0x0032U))
    \param[in]  filtery: FLTy(y=0,1)
    \param[in]   break_signal: the HPDF break signal
                 only one parameter can be selected which is shown as below:
    \arg          NO_TM_LT_BREAK: break signal is not distributed to an threshold monitor high threshold event
    \arg          TM_LT_BREAK0: break signal 0 is distributed to an threshold monitor high threshold event
    \arg          TM_LT_BREAK1: break signal 1 is distributed to an threshold monitor high threshold event
    \arg          TM_LT_BREAK0_1: break signal 0 and 1 is distributed to an threshold monitor high threshold event
    \param[out] none
    \retval     none
*/
void hpdf_low_threshold_break_signal(hpdf_filter_enum filtery, uint32_t break_signal)
{
    uint32_t reg;
    reg = HPDF_FLTyTMLT(filtery);
    reg &= ~HPDF_FLTyTMLT_LTBSD;
    /* configure the break signal */
    reg |= break_signal;
    HPDF_FLTyTMLT(filtery) = reg;
}

/*!
    \brief      configure extremes monitor channel (API_ID(0x0033U))
    \param[in]  filtery: FLTy(y=0,1)
    \param[in]  channel: which channel use extremes monitor y (y=0,1)
                only one parameter can be selected which is shown as below:
    \arg          EM_CHANNEL_DISABLE: extremes monitor y does not accept data from channel 0 and channel 1
    \arg          EM_CHANNEL0: extremes monitor y accepts data from channel 0
    \arg          EM_CHANNEL1: extremes monitor y accepts data from channel 1
    \arg          EM_CHANNEL0_1: extremes monitor y accepts data from channel 0 and channel 1
    \param[out] none
    \retval     none
*/
void hpdf_extremes_monitor_channel(hpdf_filter_enum filtery, uint32_t channel)
{
    uint32_t reg;
    reg = HPDF_FLTyCTL1(filtery);
    reg &= ~HPDF_FLTyCTL1_EMCS;
    /* configure the channel which channel use extremes monitor */
    reg |= channel;
    HPDF_FLTyCTL1(filtery) = reg;
}

/*!
    \brief      get the extremes monitor maximum value (API_ID(0x0034U))
    \param[in]  filtery: FLTy(y=0,1)
    \param[out] none
    \retval     the maximum value
*/
int32_t hpdf_extremes_monitor_maximum_get(hpdf_filter_enum filtery)
{
    uint32_t val;
    /* get the maximum value */
    val = HPDF_FLTyEMMAX(filtery) >> FLTyEMMAX_MAXVAL_OFFSET;
    /* get the sign of vlaue */
    if(val & 0x00800000U) {
        val |= 0xFF000000U;
    }
    return (int32_t)val;
}

/*!
    \brief      get the extremes monitor minimum value (API_ID(0x0035U))
    \param[in]  filtery: FLTy(y=0,1)
    \param[out] none
    \retval     the minimum value
*/
int32_t hpdf_extremes_monitor_minimum_get(hpdf_filter_enum filtery)
{
    uint32_t val;
    /* get the channel of maximum value */
    val = HPDF_FLTyEMMIN(filtery) >> FLTyEMMIN_MINVAL_OFFSET;
    /* get the sign of vlaue */
    if(val & 0x00800000U) {
        val |= 0xFF000000U;
    }
    return (int32_t)val;
}

/*!
    \brief      disable regular conversions continuous mode (API_ID(0x0036U))
    \param[in]  filtery: FLTy(y=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_rc_continuous_disable(hpdf_filter_enum filtery)
{
    HPDF_FLTyCTL0(filtery) &= ~HPDF_FLTyCTL0_RCCM;
}

/*!
    \brief      enable regular conversions continuous mode (API_ID(0x0037U))
    \param[in]  filtery: FLTy(y=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_rc_continuous_enable(hpdf_filter_enum filtery)
{
    HPDF_FLTyCTL0(filtery) |= HPDF_FLTyCTL0_RCCM;
}

/*!
    \brief      start regular channel conversion by software (API_ID(0x0038U))
    \param[in]  filtery: FLTy(y=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_rc_start_by_software(hpdf_filter_enum filtery)
{
    HPDF_FLTyCTL0(filtery) |= HPDF_FLTyCTL0_SRCS;
}

/*!
    \brief      disable regular conversion synchronously (API_ID(0x0039U))
    \param[in]  filtery: FLTy(y=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_rc_syn_disable(hpdf_filter_enum filtery)
{
    if(RESET == (HPDF_FLTyCTL0(filtery) & HPDF_FLTyCTL0_FLTEN)) {
        HPDF_FLTyCTL0(filtery) &= ~HPDF_FLTyCTL0_RCSYN;
    }
}

/*!
    \brief      enable regular conversion synchronously (API_ID(0x003AU))
    \param[in]  filtery: FLTy(y=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_rc_syn_enable(hpdf_filter_enum filtery)
{
    if(RESET == (HPDF_FLTyCTL0(filtery) & HPDF_FLTyCTL0_FLTEN)) {
        HPDF_FLTyCTL0(filtery) |= HPDF_FLTyCTL0_RCSYN;
    }
}

/*!
    \brief      disable regular conversion DMA channel (API_ID(0x003BU))
    \param[in]  filtery: FLTy(y=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_rc_dma_disable(hpdf_filter_enum filtery)
{
    if(RESET == (HPDF_FLTyCTL0(filtery) & HPDF_FLTyCTL0_FLTEN)) {
        HPDF_FLTyCTL0(filtery) &= ~HPDF_FLTyCTL0_RCDMAEN;
    }
}

/*!
    \brief      enable regular conversion DMA channel (API_ID(0x003CU))
    \param[in]  filtery: FLTy(y=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_rc_dma_enable(hpdf_filter_enum filtery)
{
    if(RESET == (HPDF_FLTyCTL0(filtery) & HPDF_FLTyCTL0_FLTEN)) {
        HPDF_FLTyCTL0(filtery) |= HPDF_FLTyCTL0_RCDMAEN;
    }
}

/*!
    \brief      configure regular conversion channel (API_ID(0x003DU))
    \param[in]  filtery: FLTy(y=0,1)
    \param[in]  channelx: the HPDF channel
                only one parameter can be selected which is shown as below:
    \arg          CHANNEL0: the HPDF channel0
    \arg          CHANNEL1: the HPDF channel1
    \param[out] none
    \retval     none
*/
void hpdf_rc_channel_config(hpdf_filter_enum filtery, hpdf_channel_enum channelx)
{
    uint32_t reg;
    reg = HPDF_FLTyCTL0(filtery);
    reg &= ~HPDF_FLTyCTL0_RCS;
    
    if(CHANNEL1 == channelx){
        reg |= HPDF_FLTyCTL0_RCS;
    }
    HPDF_FLTyCTL0(filtery) = reg;
}

/*!
    \brief      disable regular conversion fast conversion mode (API_ID(0x003EU))
    \param[in]  filtery: FLTy(y=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_rc_fast_mode_disable(hpdf_filter_enum filtery)
{
    if(RESET == (HPDF_FLTyCTL0(filtery) & HPDF_FLTyCTL0_FLTEN)) {
        HPDF_FLTyCTL0(filtery) &= ~HPDF_FLTyCTL0_FAST;
    }
}

/*!
    \brief      enable regular conversion fast conversion mode (API_ID(0x003FU))
    \param[in]  filtery: FLTy(y=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_rc_fast_mode_enable(hpdf_filter_enum filtery)
{
    if(RESET == (HPDF_FLTyCTL0(filtery) & HPDF_FLTyCTL0_FLTEN)) {
        HPDF_FLTyCTL0(filtery) |= HPDF_FLTyCTL0_FAST;
    }
}

/*!
    \brief      get the regular conversions data (API_ID(0x0040U))
    \param[in]  filtery: FLTy(y=0,1)
    \param[out] none
    \retval     regular conversions data
*/
int32_t hpdf_rc_data_get(hpdf_filter_enum filtery)
{
    uint32_t val;
    /* get the signed data */
    val = HPDF_FLTyRDATA(filtery) >> FLTyRDATAT_RDATA_OFFSET;
    /* get the sign of vlaue */
    if(val & 0x00800000U) {
        val |= 0xFF000000U;
    }
    return (int32_t)val;
}

/*!
    \brief      get the channel of regular group channel most recently converted (API_ID(0x0041U))
    \param[in]  filtery: FLTy(y=0,1)
    \param[out] none
    \retval     the channel
*/
uint8_t hpdf_rc_channel_get(hpdf_filter_enum filtery)
{
    uint8_t val;
    val = (uint8_t)HPDF_FLTyRDATA(filtery);
    val &= (uint8_t)HPDF_FLTyRDATA_RCCH;
    return val;
}

/*!
    \brief      start inserted channel conversion by software (API_ID(0x0042U))
    \param[in]  filtery: FLTy(y=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_ic_start_by_software(hpdf_filter_enum filtery)
{
    HPDF_FLTyCTL0(filtery) |= HPDF_FLTyCTL0_SICC;
}

/*!
    \brief      disable inserted conversion synchronously (API_ID(0x0043U))
    \param[in]  filtery: FLTy(y=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_ic_syn_disable(hpdf_filter_enum filtery)
{
    if(RESET == (HPDF_FLTyCTL0(filtery) & HPDF_FLTyCTL0_FLTEN)) {
        HPDF_FLTyCTL0(filtery) &= ~HPDF_FLTyCTL0_ICSYN;
    }
}

/*!
    \brief      enable inserted conversion synchronously (API_ID(0x0044U))
    \param[in]  filtery: FLTy(y=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_ic_syn_enable(hpdf_filter_enum filtery)
{
    if(RESET == (HPDF_FLTyCTL0(filtery) & HPDF_FLTyCTL0_FLTEN)) {
        HPDF_FLTyCTL0(filtery) |= HPDF_FLTyCTL0_ICSYN;
    }
}

/*!
    \brief      disable inserted conversion DMA channel (API_ID(0x0045U))
    \param[in]  filtery: FLTy(y=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_ic_dma_disable(hpdf_filter_enum filtery)
{
    if(RESET == (HPDF_FLTyCTL0(filtery) & HPDF_FLTyCTL0_FLTEN)) {
        HPDF_FLTyCTL0(filtery) &= ~HPDF_FLTyCTL0_ICDMAEN;
    }
}

/*!
    \brief      enable inserted conversion DMA channel (API_ID(0x0046U))
    \param[in]  filtery: FLTy(y=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_ic_dma_enable(hpdf_filter_enum filtery)
{
    if(RESET == (HPDF_FLTyCTL0(filtery) & HPDF_FLTyCTL0_FLTEN)) {
        HPDF_FLTyCTL0(filtery) |= HPDF_FLTyCTL0_ICDMAEN;
    }
}

/*!
    \brief      disable scan conversion mode (API_ID(0x0047U))
    \param[in]  filtery: FLTy(y=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_ic_scan_mode_disable(hpdf_filter_enum filtery)
{
    if(RESET == (HPDF_FLTyCTL0(filtery) & HPDF_FLTyCTL0_FLTEN)) {
        HPDF_FLTyCTL0(filtery) &= ~HPDF_FLTyCTL0_SCMOD;
    }
}

/*!
    \brief      enable scan conversion mode (API_ID(0x0048U))
    \param[in]  filtery: HPDF_FLTy(y=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_ic_scan_mode_enable(hpdf_filter_enum filtery)
{
    if(RESET == (HPDF_FLTyCTL0(filtery) & HPDF_FLTyCTL0_FLTEN)) {
        HPDF_FLTyCTL0(filtery) |= HPDF_FLTyCTL0_SCMOD;
    }
}

/*!
    \brief      disable inserted conversions trigger signal (API_ID(0x0049U))
    \param[in]  filtery: FLTy(y=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_ic_trigger_signal_disable(hpdf_filter_enum filtery)
{
    if(RESET == (HPDF_FLTyCTL0(filtery) & HPDF_FLTyCTL0_FLTEN)) {
        HPDF_FLTyCTL0(filtery) &= ~HPDF_FLTyCTL0_ICTEEN;
    }
}

/*!
    \brief      configure inserted conversions trigger signal and trigger edge (API_ID(0x004AU))
    \param[in]  filtery: FLTy(y=0,1)
    \param[in]  trigger: inserted conversions trigger signal
                only one parameter can be selected which is shown as below:
    \arg          HPDF_ITRG0: TIMER1_TRGO is selected to start inserted conversion
    \arg          HPDF_ITRG1: TIMER2_TRGO is selected to start inserted conversion
    \arg          HPDF_ITRG2: TIMER3_TRGO is selected to start inserted conversion
    \arg          HPDF_ITRG3: TIMER4_TRGO is selected to start inserted conversion
    \arg          HPDF_ITRG24: EXTI11 is selected to start inserted conversion
    \arg          HPDF_ITRG25: EXTI15 is selected to start inserted conversion
    \arg          HPDF_ITRG26: TIMER5_TRGO is selected to start inserted conversion
    \param[in]  trigger_edge: inserted conversions trigger edge
                only one parameter can be selected which is shown as below:
    \arg          TRG_DISABLE: disable trigger signal
    \arg          RISING_EDGE_TRG: rising edge on the trigger signal
    \arg          FALLING_EDGE_TRG: falling edge on the trigger signal
    \arg          EDGE_TRG: edge (rising edges and falling edges) on the trigger signal
    \param[out] none
    \retval     none
*/
void hpdf_ic_trigger_signal_config(hpdf_filter_enum filtery,  uint32_t trigger, uint32_t trigger_edge)
{
    uint32_t reg;
    /* make sure the FLTEN=0 */
    if(RESET == (HPDF_FLTyCTL0(filtery) & HPDF_FLTyCTL0_FLTEN)) {
        reg = HPDF_FLTyCTL0(filtery);
        reg &= ~(HPDF_FLTyCTL0_ICTEEN | HPDF_FLTyCTL0_ICTSSEL);
        /* configure inserted conversions trigger signal and trigger edge */
        reg |= (trigger | trigger_edge);
        HPDF_FLTyCTL0(filtery) = reg;
    }
}

/*!
    \brief      configure inserted group conversions channel (API_ID(0x004BU))
    \param[in]  filtery: FLTy(y=0,1)
    \param[in]  channel: the HPDF channel belongs to inserted group
                only one parameter can be selected which is shown as below:
    \arg          IGCSEL_CHANNEL0: channel0 belongs to the inserted group
    \arg          IGCSEL_CHANNEL1: channel1 belongs to the inserted group
    \arg          IGCSEL_CHANNEL0_1: channel0 and channel1 belongs to the inserted group
    \param[out] none
    \retval     none
*/
void hpdf_ic_channel_config(hpdf_filter_enum filtery, uint32_t channel)
{
    uint32_t reg;
    reg = HPDF_FLTyIGCS(filtery);
    reg &= ~HPDF_FLTyIGCS_IGCSEL;
    reg |= channel;
    HPDF_FLTyIGCS(filtery) = reg;
}

/*!
    \brief      get the inserted conversions data (API_ID(0x004CU))
    \param[in]  filtery: HPDF_FLTy(y=0,1)
    \param[out] none
    \retval     inserted conversions data
*/
int32_t hpdf_ic_data_get(hpdf_filter_enum filtery)
{
    uint32_t val;
    /* get the unsigned data  */
    val = HPDF_FLTyIDATA(filtery) >> FLTyIDATAT_IDATA_OFFSET;
    /* get the sign of vlaue */
    /* get the sign of vlaue */
    if(val & 0x00800000U) {
        val |= 0xFF000000U;
    }
    /* get the signed data */
    return (int32_t)val;
}

/*!
    \brief      get the channel of inserted group channel most recently converted (API_ID(0x004DU))
    \param[in]  filtery: HPDF_FLTy(y=0,1)
    \param[out] none
    \retval     the channel
*/
uint8_t hpdf_ic_channel_get(hpdf_filter_enum filtery)
{
    uint8_t val;
    val = (uint8_t)HPDF_FLTyIDATA(filtery);
    val &= (uint8_t)HPDF_FLTyIDATA_ICCH;
    return val;
}

/*!
    \brief      get the HPDF flags (API_ID(0x004EU))
    \param[in]  filtery: FLTy(y=0,1)
    \param[in]  flag: HPDF flags, refer to hpdf_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        HPDF_FLAG_FLTy_ICEF: FLTy inserted conversion end flag
      \arg        HPDF_FLAG_FLTy_RCEF: FLTy regular conversion end flag
      \arg        HPDF_FLAG_FLTy_ICDOF: FLTy inserted conversion data overflow flag
      \arg        HPDF_FLAG_FLTy_RCDOF: FLTy regular conversion data overflow flag
      \arg        HPDF_FLAG_FLTy_TMEOF: FLTy threshold monitor event occurred flag
      \arg        HPDF_FLAG_FLTy_ICPF: FLTy inserted conversion in progress flag
      \arg        HPDF_FLAG_FLTy_RCPF: FLTy regular conversion in progress flag
      \arg        HPDF_FLAG_FLT0_CKLF0: clock signal is lost on channel 0 flag
      \arg        HPDF_FLAG_FLT0_CKLF1: clock signal is lost on channel 1 flag
      \arg        HPDF_FLAG_FLT0_MMF0: malfunction event occurred on channel 0 flag
      \arg        HPDF_FLAG_FLT0_MMF1: malfunction event occurred on channel 1 flag
      \arg        HPDF_FLAG_FLTy_RCHPDT: FLTy regular channel pending data flag
      \arg        HPDF_FLAG_FLTy_LTF0: threshold monitor low threshold on channel 0 flag
      \arg        HPDF_FLAG_FLTy_LTF1: threshold monitor low threshold on channel 1 flag
      \arg        HPDF_FLAG_FLTy_HTF0: threshold monitor high threshold on channel 0 flag
      \arg        HPDF_FLAG_FLTy_HTF1: threshold monitor high threshold on channel 1 flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus hpdf_flag_get(hpdf_filter_enum filtery, hpdf_flag_enum flag)
{
    if(FLT0 == filtery) {
        /* get the flag in FLT0 register */
        if(RESET != (HPDF_REG_VAL(HPDF_FLT0, flag) & BIT(HPDF_BIT_POS(flag)))) {
            return SET;
        } else {
            return RESET;
        }
    } else {
        /* get the flag in FLT1 register */
        if(RESET != (HPDF_REG_VAL(HPDF_FLT1, flag) & BIT(HPDF_BIT_POS(flag)))) {
            return SET;
        } else {
            return RESET;
        }
    }
}

/*!
    \brief      clear the HPDF flags (API_ID(0x004FU))
    \param[in]  filtery: FLTy(y=0,1)
    \param[in]  flag: HPDF flags, refer to hpdf_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        HPDF_FLAG_FLTy_ICEF: FLTy inserted conversion end flag
      \arg        HPDF_FLAG_FLTy_RCEF: FLTy regular conversion end flag
      \arg        HPDF_FLAG_FLTy_ICDOF: FLTy inserted conversion data overflow flag
      \arg        HPDF_FLAG_FLTy_RCDOF: FLTy regular conversion data overflow flag
      \arg        HPDF_FLAG_FLTy_TMEOF: FLTy threshold monitor event occurred flag
      \arg        HPDF_FLAG_FLT0_CKLF0: clock signal is lost on channel 0 flag
      \arg        HPDF_FLAG_FLT0_CKLF1: clock signal is lost on channel 1 flag
      \arg        HPDF_FLAG_FLT0_MMF0: malfunction event occurred on channel 0 flag
      \arg        HPDF_FLAG_FLT0_MMF1: malfunction event occurred on channel 1 flag
      \arg        HPDF_FLAG_FLTy_LTF0: threshold monitor low threshold on channel 0 flag
      \arg        HPDF_FLAG_FLTy_LTF1: threshold monitor low threshold on channel 1 flag
      \arg        HPDF_FLAG_FLTy_HTF0: threshold monitor high threshold on channel 0 flag
      \arg        HPDF_FLAG_FLTy_HTF1: threshold monitor high threshold on channel 1 flag
    \param[out] none
    \retval     none
*/
void hpdf_flag_clear(hpdf_filter_enum filtery, hpdf_flag_enum flag)
{
    uint32_t val;

